{
  "status": "full_coverage",
  "detectedStack": [
    "TypeScript",
    "React",
    "Next.js",
    "React Native",
    "Expo 52+",
    "Turborepo",
    "Clerk",
    "Convex",
    "Vercel",
    "react-native-shake",
    "react-native-view-shot",
    "@shopify/react-native-skia"
  ],
  "convexContext": {
    "mode": "cloud-live",
    "evidence": [
      "User confirmed: ShakeNbake Cloud deployment targets Convex Cloud (production)",
      "apps/cloud: Next.js frontend with Convex backend on Vercel",
      "CI/CD uses CONVEX_DEPLOY_KEY for cloud production deployments",
      "Postgres database via Neon/Supabase with Prisma schema management",
      "Convex functions handle audio transcription (OpenAI Whisper), billing (Stripe), auth (Clerk)",
      "No local-dev or staged deployment workflows detected — direct cloud-live only"
    ]
  },
  "deploymentContext": {
    "mode": "hybrid",
    "vercelCliAvailable": true,
    "githubIntegrationDetected": true,
    "evidence": [
      "Vercel CLI installed and available (command -v vercel succeeds)",
      "GitHub integration: .github/workflows/ contains Vercel deployment automation",
      "Hybrid topology: both CLI for local dev iteration and GitHub Actions for CI/CD",
      "Vercel environment variables configured for Next.js + Convex integration",
      "Automatic deployments on push to main branch via GitHub Actions"
    ]
  },
  "routingPlan": [
    {
      "surface": "backend",
      "recommendedAgent": "whycode:backend-agent",
      "reason": "Core TypeScript types, plugin system, and shared utilities (@shakenbake/core). Generic backend agent handles TypeScript compilation, plugin registry patterns, and type definitions across monorepo."
    },
    {
      "surface": "frontend-native",
      "recommendedAgent": "whycode:frontend-native-agent",
      "reason": "SPECIALIST REQUIRED: React Native SDK (@shakenbake/react-native) with Expo 52+, react-native-shake, react-native-view-shot, @shopify/react-native-skia. Specialist handles mobile runtime correctness, async trigger patterns, Android GL/Skia surface compatibility, and Expo development build configuration."
    },
    {
      "surface": "frontend-web",
      "recommendedAgent": "whycode:frontend-web-agent",
      "reason": "SPECIALIST REQUIRED: ShakeNbake Cloud frontend (apps/cloud) built on Next.js App Router. Specialist handles Vercel integration, server-side rendering, client/server boundary patterns, and Clerk SSO integration."
    },
    {
      "surface": "backend",
      "recommendedAgent": "whycode:backend-convex-agent",
      "reason": "SPECIALIST REQUIRED: Convex functions (apps/cloud/convex) with cloud-live deployment mode. Specialist ensures production-safe Convex schema patterns, function authorization, Whisper integration, Stripe billing, and cloud deployment guardrails. DEPLOYMENT MODE: cloud-live means all functions must be production-hardened — no local-only patterns."
    },
    {
      "surface": "backend",
      "recommendedAgent": "whycode:backend-auth-agent",
      "reason": "SPECIALIST REQUIRED: Clerk integration (auth layer for Cloud app). Specialist handles Clerk middleware, OIDC/SSO webhooks, multi-tenancy scoping, JWT validation, and organization-scoped access control."
    },
    {
      "surface": "deploy",
      "recommendedAgent": "whycode:deploy-vercel-agent",
      "reason": "SPECIALIST REQUIRED: Vercel deployment topology (hybrid: GitHub integration + CLI). Specialist detects GitHub Actions integration, configures environment variables (CONVEX_DEPLOY_KEY, Clerk secrets, Stripe keys), and validates runtime readiness. TOPOLOGY MODE: hybrid means agent must ensure CI/CD does not conflict with local dev workflows."
    },
    {
      "surface": "shared",
      "recommendedAgent": "whycode:test-agent",
      "reason": "Vitest-based testing across all packages (core, react-native, cloud functions). Specialist TDD agent for red-green-refactor protocol, test coverage validation, and integration test setup."
    }
  ],
  "gaps": [],
  "recommendedAction": "proceed",
  "notes": "FINAL CAPABILITY PASS: All specialist agents confirmed available. Full tech stack coverage across monorepo (core library + mobile SDK + cloud app). CONVEX MODE RESOLVED: User confirmed cloud-live deployment — all Convex functions must target production cloud only. Convex backend-agent will enforce production-safe patterns (no local-dev workarounds). DEPLOYMENT TOPOLOGY: Hybrid (GitHub Actions + Vercel CLI) — deploy-vercel-agent will coordinate both workflows and prevent conflicts. ROUTING RATIONALE: (1) Backend agent handles core plugin system and TypeScript compilation; (2) Frontend-native agent specializes in Expo, React Native runtime, and mobile async patterns; (3) Frontend-web agent specializes in Next.js App Router and Vercel integration; (4) Backend-convex agent specializes in Convex cloud functions with deployment-mode guardrails (cloud-live = production only); (5) Backend-auth agent specializes in Clerk multi-tenancy and webhook security; (6) Deploy-vercel agent specializes in Vercel topology detection and environment variable validation; (7) Test agent provides TDD protocol across all surfaces. MANDATORY CHECKS: Convex backend-agent must verify CONVEX_DEPLOY_KEY presence and validate Convex CLI is authenticated to cloud deployment. Frontend-web-agent must verify Clerk configuration (CLERK_SECRET_KEY, CLERK_PUBLISHABLE_KEY). Deploy-vercel-agent must verify GitHub integration does not overwrite local environment vars. NO BLOCKING GAPS. Ready for specialist agent execution."
}
